;--------------------------------------------------
;---------------- Upgrade Templates ---------------
;--------------------------------------------------
[FreeFireUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Hair Trigger"
FriendlyNamePlural="Hair Triggers"
BriefSummary="When firing, the soldier has a 30% chance that to trigger a second shot if the first one misses"
TinySummary="Chance on 2nd shot if the 1st shot misses"
LootTooltip="This weapon upgrade, when installed, adds a 30% chance that when firing, a second shot will be taken if the first one misses."

[FreeFireUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Hair Trigger"
FriendlyNamePlural="Advanced Hair Triggers"
BriefSummary="When firing, the soldier has a 50% chance that to trigger a second shot if the first one misses"
TinySummary="Chance on 2nd shot if the 1st shot misses"
LootTooltip="This weapon upgrade, when installed, adds a 50% chance that when firing, a second shot will be taken if the first one misses."

[FreeFireUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Hair Trigger"
FriendlyNamePlural="Superior Hair Triggers"
BriefSummary="When firing, the soldier has a 70% chance that to trigger a second shot if the first one misses"
TinySummary="Chance on 2nd shot if the 1st shot misses"
LootTooltip="This weapon upgrade, when installed, adds a 70% chance that when firing, a second shot will be taken if the first one misses."

[CritUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Laser Sight"
FriendlyNamePlural="Laser Sights"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%, improving even further with proximity to target. This feat comes with the disadvantage of an aim penalty for mid to long range targets"
TinySummary="Increased Crit Chance but aim penalty against mid to long range."
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[CritUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Laser Sight"
FriendlyNamePlural="Advanced Laser Sights"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%, improving even further with proximity to target. This feat comes with the disadvantage of an aim penalty for mid to long range targets"
TinySummary="Increased Crit Chance but aim penalty against mid to long range."
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[CritUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Laser Sight"
FriendlyNamePlural="Superior Laser Sights"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%, improving even further with proximity to target. This feat comes with the disadvantage of an aim penalty for mid to long range targets"
TinySummary="Increased Crit Chance but aim penalty against mid to long range."
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[MissDamageUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Stock"
FriendlyNamePlural="Stocks"
BriefSummary="You have +10 to hit on reaction fire shots."
TinySummary="You have +10 to hit on reaction fire shots."
LootTooltip="This weapon upgrade, when installed, you have +10 to hit on reaction fire shots."

[MissDamageUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Stock"
FriendlyNamePlural="Advanced Stocks"
BriefSummary="You have +15 to hit on reaction fire shots."
TinySummary="You have +15 to hit on reaction fire shots."
LootTooltip="This weapon upgrade, when installed, you have +15 to hit on reaction fire shots."

[MissDamageUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Stock"
FriendlyNamePlural="Superior Stocks"
BriefSummary="You have +20 to hit on reaction fire shots."
TinySummary="You have +20 to hit on reaction fire shots."
LootTooltip="This weapon upgrade, when installed, you have +20 to hit on reaction fire shots."

[AimUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Scope"
FriendlyNamePlural="Scopes"
BriefSummary="Changes the range table providing a hit bonus against long range targets but penalizing short range"
TinySummary="Increased Aim for long long range"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[AimUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Scope"
FriendlyNamePlural="Advanced Scopes"
BriefSummary="Changes the range table providing a hit bonus against long range targets but penalizing short range"
TinySummary="Increased Aim for long long range"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[AimUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Scope"
FriendlyNamePlural="Superior Scopes"
BriefSummary="Changes the range table providing a hit bonus against long range targets but penalizing short range"
TinySummary="Increased Aim"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[ReloadUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Auto-Loader"
FriendlyNamePlural="Auto-Loaders"
BriefSummary="Auto reload 1 ammo per turn to a maximum of 4."
TinySummary="Auto reload 1 ammo per turn to a maximum of 4."
LootTooltip="This weapon upgrade provides auto reloading 1 ammo per turn to a maximum of 4."

[ReloadUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Auto-Loader"
FriendlyNamePlural="Advanced Auto-Loaders"
BriefSummary="Auto reload 1 ammo per turn to a maximum of 6."
TinySummary="Auto reload 1 ammo per turn to a maximum of 6."
LootTooltip="This weapon upgrade provides auto reloading 1 ammo per turn to a maximum of 6."

[ReloadUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Auto-Loader"
FriendlyNamePlural="Superior Auto-Loaders"
BriefSummary="Auto reload 1 ammo per turn to a maximum of 8."
TinySummary="Auto reload 1 ammo per turn to a maximum of 8."
LootTooltip="This weapon upgrade provides auto reloading 1 ammo per turn to a maximum of 8."

[EleriumCoating_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Elerium Coating"
FriendlyNamePlural="Elerium Coatings"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%."
TinySummary="Increased Crit Chance"
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[EleriumCoating_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Elerium Coating"
FriendlyNamePlural="Advanced Elerium Coatings"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%."
TinySummary="Increased Crit Chance"
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[EleriumCoating_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Elerium Coating"
FriendlyNamePlural="Superior Elerium Coatings"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>."
TinySummary="Increased Crit Chance"
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[AlloyBlade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Balanced Alloy Blade"
FriendlyNamePlural="Balanced Alloy Blades"
BriefSummary="Increase aim by +<Ability:SCOPEAIMINCREASE/>%."
TinySummary="Increased Aim"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[AlloyBlade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Balanced Alloy Blade"
FriendlyNamePlural="Advanced Balanced Alloy Blades"
BriefSummary="Increase aim by +<Ability:SCOPEAIMINCREASE/>%."
TinySummary="Increased Aim"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[AlloyBlade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Balanced Alloy Blade"
FriendlyNamePlural="Superior Balanced Alloy Blades"
BriefSummary="Increase aim by +<Ability:SCOPEAIMINCREASE/>%."
TinySummary="Increased Aim"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."
;--------------------------------------------------
;-------------------- Abilities -------------------
;--------------------------------------------------

[OpticScopeRangeModifier X2AbilityTemplate]
LocFriendlyName="Optic Scope"
LocHelpText="Improves the range by one category."

[Scope_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="Scope"
LocLongDescription="You have +5 to hit on non-reaction fire shots with your primary weapon. Also improves the weapons range table by one category."
LocHelpText="Scope: Bonus to hit on non-reaction fire"
LocFlyOverText="Scope"

[Scope_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="Advanced Scope"
LocLongDescription="You have +10 to hit on non-reaction fire shots with your primary weapon. Also improves the weapons range table by one category."
LocHelpText="Scope: Bonus to hit on non-reaction fire. Also improves the weapons range table by one category."
LocFlyOverText="Advanced Scope"

[Scope_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="Superior Scope"
LocLongDescription="You have +15 to hit on non-reaction fire shots with your primary weapon. Also improves the weapons range table by one category."
LocHelpText="Scope: Bonus to hit on non-reaction fire. Also improves the weapons range table by one category."
LocFlyOverText="Superior Scope"

[AutoLoader_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="Auto-Loader: Free Reload"
LocLongDescription="20% Chance that reloading refunds an action point."
LocHelpText="AutoLoader: 20% Chance that reloading refunds an action point."
LocFlyOverText="Scope"

[AutoLoader_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="Advanced Auto-Loader: Free Reload"
LocLongDescription="40% Chance that reloading refunds an action point."
LocHelpText="AutoLoader: 40% Chance that reloading refunds an action point."
LocFlyOverText="Advanced Autoloader"

[AutoLoader_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="Superior Auto-Loader: Free Reload"
LocLongDescription="60% Chance that reloading refunds an action point."
LocHelpText="AutoLoader: 60% Chance that reloading refunds an action point."
LocFlyOverText="Superior Autoloader"

[Hair_Trigger_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="Hair Trigger Shot"
LocHelpText="When a shot misses there is a 50% chance a second shot is fired. The second shot has a 10% better hit chance."

[Hair_Trigger_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="Hair Trigger Shot"
LocHelpText="When a shot misses there is a 70% chance a second shot is fired. The second shot has a 15% better hit chance."

[Hair_Trigger_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="Hair Trigger Shot"
LocHelpText="When a shot misses there is a 90% chance a second shot is fired. The second shot has a 20% better hit chance."

[LaserSight_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="Laser Sight"

[LaserSight_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="Advanced Laser Sight"

[LaserSight_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="Superior Laser Sight"
